; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	spectrograph1 - mode
	infrared2 - mode
	thermograph4 - mode
	infrared0 - mode
	image3 - mode
	GroundStation1 - direction
	GroundStation5 - direction
	Star9 - direction
	GroundStation6 - direction
	Star10 - direction
	Star11 - direction
	Star0 - direction
	GroundStation7 - direction
	Star3 - direction
	Star8 - direction
	GroundStation2 - direction
	Star4 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 thermograph4)
	(supports instrument0 infrared2)
	(calibration_target instrument0 GroundStation6)
	(calibration_target instrument0 Star0)
	(calibration_target instrument0 Star9)
	(calibration_target instrument0 Star11)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon13)
	(supports instrument1 image3)
	(supports instrument1 spectrograph1)
	(supports instrument1 infrared2)
	(calibration_target instrument1 GroundStation7)
	(calibration_target instrument1 Star0)
	(calibration_target instrument1 Star11)
	(calibration_target instrument1 Star10)
	(supports instrument2 image3)
	(supports instrument2 infrared2)
	(calibration_target instrument2 GroundStation7)
	(supports instrument3 thermograph4)
	(supports instrument3 image3)
	(supports instrument3 infrared2)
	(calibration_target instrument3 Star4)
	(calibration_target instrument3 GroundStation2)
	(calibration_target instrument3 Star8)
	(calibration_target instrument3 Star3)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star4)
)
(:goal (and
	(pointing satellite0 Phenomenon15)
	(have_image Planet12 infrared2)
	(have_image Phenomenon13 spectrograph1)
	(have_image Phenomenon14 thermograph4)
	(have_image Phenomenon15 spectrograph1)
))

)

; plan
1. (turn_to satellite0 phenomenon15 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon15)
   goals met: 1 of 5
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 1 of 5
3. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 5
4. (turn_to satellite1 phenomenon13 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 phenomenon13)
   goals met: 1 of 5
5. (turn_to satellite1 star11 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 star11)
   goals met: 1 of 5
6. (calibrate satellite1 instrument1 star11)
   added: (calibrated instrument1)
   goals met: 1 of 5
7. (turn_to satellite1 phenomenon13 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 phenomenon13)
   goals met: 1 of 5
8. (take_image satellite1 phenomenon13 instrument1 spectrograph1)
   added: (have_image phenomenon13 spectrograph1)
   goals met: 2 of 5
9. (turn_to satellite1 phenomenon15 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 phenomenon15)
   goals met: 2 of 5
10. (take_image satellite1 phenomenon15 instrument1 spectrograph1)
   added: (have_image phenomenon15 spectrograph1)
   goals met: 3 of 5
11. (turn_to satellite1 planet12 phenomenon15)
   deleted: (pointing satellite1 phenomenon15)
   added: (pointing satellite1 planet12)
   goals met: 3 of 5
12. (take_image satellite1 planet12 instrument1 infrared2)
   added: (have_image planet12 infrared2)
   goals met: 4 of 5
13. (turn_to satellite0 star9 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 star9)
   goals met: 3 of 5
14. (calibrate satellite0 instrument0 star9)
   added: (calibrated instrument0)
   goals met: 3 of 5
15. (turn_to satellite0 phenomenon14 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 phenomenon14)
   goals met: 3 of 5
16. (take_image satellite0 phenomenon14 instrument0 thermograph4)
   added: (have_image phenomenon14 thermograph4)
   goals met: 4 of 5
17. (turn_to satellite0 phenomenon15 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon15)
   goals met: 5 of 5
